In [4]:
#Import Libraries panda, numpy and matplotlib.pyplot
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
bom = pd.read_csv('datauz/bom.movie_gross.csv')
bom.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [6]:
bom.info()
bom.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
title             3387 non-null object
studio            3382 non-null object
domestic_gross    3359 non-null float64
foreign_gross     2037 non-null object
year              3387 non-null int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

       domestic_gross         year
count    3.359000e+03  3387.000000
mean     2.874585e+07  2013.958075
std      6.698250e+07     2.478141
min      1.000000e+02  2010.000000
25%      1.200000e+05  2012.000000
50%      1.400000e+06  2014.000000
75%      2.790000e+07  2016.000000
max      9.367000e+08  2018.000000

In [7]:
imdbname = pd.read_csv('datauz/imdb.name.basics.csv')
imdbname.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [8]:
imdbname.info()
imdbname.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
nconst                606648 non-null object
primary_name          606648 non-null object
birth_year            82736 non-null float64
death_year            6783 non-null float64
primary_profession    555308 non-null object
known_for_titles      576444 non-null object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

         birth_year   death_year
count  82736.000000  6783.000000
mean    1967.043826  2000.523367
std       22.122190    43.951530
min        1.000000    17.000000
25%     1957.000000  2001.000000
50%     1971.000000  2013.000000
75%     1981.000000  2016.000000
max     2014.000000  2019.000000

In [9]:
#Exploring all the data from IMDB
imdbbasics = pd.read_csv('datauz/imdb.title.basics.csv')
imdbbasics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [10]:
imdbbasics.info()
imdbbasics.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
tconst             146144 non-null object
primary_title      146144 non-null object
original_title     146123 non-null object
start_year         146144 non-null int64
runtime_minutes    114405 non-null float64
genres             140736 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

          start_year  runtime_minutes
count  146144.000000    114405.000000
mean     2014.621798        86.187247
std         2.733583       166.360590
min      2010.000000         1.000000
25%      2012.000000        70.000000
50%      2015.000000        87.000000
75%      2017.000000        99.000000
max      2115.000000     51420.000000

In [11]:
imdbprincipals = pd.read_csv('datauz/imdb.title.principals.csv')
imdbprincipals.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [12]:
imdbprincipals.info()
imdbprincipals.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1028186 entries, 0 to 1028185
Data columns (total 6 columns):
tconst        1028186 non-null object
ordering      1028186 non-null int64
nconst        1028186 non-null object
category      1028186 non-null object
job           177684 non-null object
characters    393360 non-null object
dtypes: int64(1), object(5)
memory usage: 47.1+ MB

           ordering
count  1.028186e+06
mean   4.739847e+00
std    2.747446e+00
min    1.000000e+00
25%    2.000000e+00
50%    4.000000e+00
75%    7.000000e+00
max    1.000000e+01

In [13]:
imdbcrew = pd.read_csv('datauz/imdb.title.crew.csv')
imdbcrew.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [14]:
imdbcrew.info()
imdbcrew.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
tconst       146144 non-null object
directors    140417 non-null object
writers      110261 non-null object
dtypes: object(3)
memory usage: 3.3+ MB

           tconst  directors    writers
count      146144     140417     110261
unique     146144      98525      91920
top     tt3207318  nm3266654  nm0000636
freq            1         62         80

In [15]:
imdbratings = pd.read_csv('datauz/imdb.title.ratings.csv')
imdbratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [16]:
imdbratings.info()
imdbratings.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
tconst           73856 non-null object
averagerating    73856 non-null float64
numvotes         73856 non-null int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06

In [17]:
imdbakas = pd.read_csv('datauz/imdb.title.akas.csv')
imdbakas.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [18]:
imdbakas.info()
imdbakas.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
title_id             331703 non-null object
ordering             331703 non-null int64
title                331703 non-null object
region               278410 non-null object
language             41715 non-null object
types                168447 non-null object
attributes           14925 non-null object
is_original_title    331678 non-null float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

            ordering  is_original_title
count  331703.000000      331678.000000
mean        5.125872           0.134769
std         6.706664           0.341477
min         1.000000           0.000000
25%         1.000000           0.000000
50%         2.000000           0.000000
75%         6.000000           0.000000
max        61.000000           1.000000

In [19]:
tmdb = pd.read_csv('datauz/tmdb.movies.csv')
tmdb.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [20]:
tmdb.info()
tmdb.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
Unnamed: 0           26517 non-null int64
genre_ids            26517 non-null object
id                   26517 non-null int64
original_language    26517 non-null object
original_title       26517 non-null object
popularity           26517 non-null float64
release_date         26517 non-null object
title                26517 non-null object
vote_average         26517 non-null float64
vote_count           26517 non-null int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

        Unnamed: 0             id    popularity  vote_average    vote_count
count  26517.00000   26517.000000  26517.000000  26517.000000  26517.000000
mean   13258.00000  295050.153260      3.130912      5.991281    194.224837
std     7654.94288  153661.615648      4.355229      1.852946    960.961095
min        0.00000      27.000000      0.600000      0.000000      1.000000
25%     6629.00000  157851.000000      0.600000      5.000000      2.000000
50%    13258.00000  309581.000000      1.374000      6.000000      5.000000
75%    19887.00000  419542.000000      3.694000      7.000000     28.000000
max    26516.00000  608444.000000     80.773000     10.000000  22186.000000

In [21]:
#Import tn dataset originally (https://www.the-numbers.com/movie/budgets/all)
tn = pd.read_csv('datauz/tn.movie_budgets.csv')
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [22]:
tn.info()
tn.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.1+ KB

                id
count  5782.000000
mean     50.372363
std      28.821076
min       1.000000
25%      25.000000
50%      50.000000
75%      75.000000
max     100.000000

In [23]:
#converting production_budget, domestic_gross, and worldwide_gross from objects to int values
tn.production_budget = tn.production_budget.replace('[\$,]', '', regex=True).astype(int)
tn.domestic_gross = tn.domestic_gross.replace('[\$,]', '', regex=True).astype(int)
tn.worldwide_gross = tn.worldwide_gross.replace('[\$,]', '', regex=True).astype(int)

In [24]:
tn.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null int64
domestic_gross       5782 non-null int64
worldwide_gross      5782 non-null int64
dtypes: int64(4), object(2)
memory usage: 271.1+ KB

In [25]:
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747

In [26]:
#created international_gross variable to assist in seeing success internationally compared to domestically
tn['international_gross'] = tn.worldwide_gross - tn.domestic_gross

In [27]:
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,international_gross
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2015837654
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,804600000
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,107000000
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,944008095
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,696540365

In [28]:
#creted profit variable to show overall success of movie, which is determined by how much profit it made
tn['profit'] = tn.worldwide_gross - tn.production_budget

In [29]:
tn.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,international_gross,profit
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2015837654,2351345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,804600000,635063875
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,107000000,-200237650
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,944008095,1072413963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,696540365,999721747

In [30]:
#sorting tn data set by profit, descending
tn.sort_values(by='profit', ascending=False)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,international_gross,profit
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2015837654,2351345279
42,43,"Dec 19, 1997",Titanic,200000000,659363944,2208208395,1548844451,2008208395
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200,1369318718,1748134200
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,1116648995,1747311220
33,34,"Jun 12, 2015",Jurassic World,215000000,652270625,1648854864,996584239,1433854864
66,67,"Apr 3, 2015",Furious 7,190000000,353007020,1518722794,1165715774,1328722794
26,27,"May 4, 2012",The Avengers,225000000,623279547,1517935897,894656350,1292935897
260,61,"Jul 15, 2011",Harry Potter and the Deathly Hallows: Part II,125000000,381193157,1341693157,960500000,1216693157
41,42,"Feb 16, 2018",Black Panther,200000000,700059566,1348258224,648198658,1148258224
112,13,"Jun 22, 2018",Jurassic World: Fallen Kingdom,170000000,417719760,1305772799,888053039,1135772799
155,56,"Nov 22, 2013",Frozen,150000000,400738009,1272469910,871731901,1122469910
134,35,"Mar 17, 2017",Beauty and the Beast,160000000,504014165,1259199706,755185541,1099199706
672,73,"Jul 10, 2015",Minions,74000000,336045770,1160336173,824290403,1086336173
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,944008095,1072413963
425,26,"Dec 17, 2003",The Lord of the Rings: The Return of the King,94000000,377845905,1141403341,763557436,1047403341
43,44,"Jun 15, 2018",Incredibles 2,200000000,608581744,1242520711,633938967,1042520711
47,48,"May 3, 2013",Iron Man 3,200000000,408992272,1215392272,806400000,1015392272
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,696540365,999721747
135,36,"Dec 21, 2018",Aquaman,160000000,335061807,1146894640,811832833,986894640
22,23,"Apr 14, 2017",The Fate of the Furious,250000000,225764765,1234846267,1009081502,984846267
824,25,"Jun 11, 1993",Jurassic Park,63000000,395708305,1038812584,643104279,975812584
629,30,"Jun 30, 2017",Despicable Me 3,75000000,264624300,1034727750,770103450,959727750
95,96,"Mar 8, 2019",Captain Marvel,175000000,426525952,1123061550,696535598,948061550
63,64,"Jun 29, 2011",Transformers: Dark of the Moon,195000000,352390543,1123790543,771400000,928790543
303,4,"May 19, 1999",Star Wars Ep. I: The Phantom Menace,115000000,474544677,1027044677,552500000,912044677
51,52,"Nov 8, 2012",Skyfall,200000000,304360277,1110526981,806166704,910526981
608,9,"Jun 15, 1994",The Lion King,79300000,421785283,986214868,564429585,906914868
621,22,"Jul 3, 2013",Despicable Me 2,76000000,368065385,975216835,607151450,899216835
36,37,"Jun 27, 2014",Transformers: Age of Extinction,210000000,245439076,1104039076,858600000,894039076
16,17,"May 6, 2016",Captain America: Civil War,250000000,408084349,1140069413,731985064,890069413
...,...,...,...,...,...,...,...,...
817,18,"Oct 27, 2000",Lucky Numbers,65000000,10014234,10014234,0,-54985766
743,44,"Sep 20, 2002",Ballistic: Ecks vs. Sever,70000000,14294842,14294842,0,-55705158
744,45,"Aug 10, 2001",Osmosis Jones,70000000,13596911,13596911,0,-56403089
603,4,"Dec 25, 1997",The Postman,80000000,17650704,20841123,3190419,-59158877
952,53,"Nov 8, 2019",Midway,59500000,0,0,0,-59500000
951,52,"Dec 11, 2015",The Ridiculous 6,60000000,0,0,0,-60000000
667,68,"Oct 23, 1998",Soldier,75000000,14623082,14623082,0,-60376918
220,21,"Jul 29, 2005",Stealth,138000000,32116746,76416746,44300000,-61583254
281,82,"Aug 27, 1999",The 13th Warrior,125000000,32698899,61698899,29000000,-63301101
280,81,"Jan 13, 2017",Monster Trucks,125000000,33370166,61642798,28272632,-63357202
820,21,"Oct 26, 2018",Air Strike,65000000,0,516279,516279,-64483721
434,35,"Apr 9, 2004",The Alamo,92000000,22406362,23911362,1505000,-68088638
478,79,"Nov 24, 2010",The Nutcracker in 3D,90000000,195459,20466016,20270557,-69533984
669,70,"Feb 23, 2001",Monkeybone,75000000,5409517,5409517,0,-69590483
300,1,"Dec 17, 2010",How Do You Know?,120000000,30212620,49628177,19415557,-70371823
435,36,"Dec 22, 1995",Cutthroat Island,92000000,10017322,18517322,8500000,-73482678
607,8,"Sep 2, 2005",A Sound of Thunder,80000000,1900451,6300451,4400000,-73699549
671,72,"Dec 31, 2019",355,75000000,0,0,0,-75000000
670,71,"Aug 30, 2019",PLAYMOBIL,75000000,0,0,0,-75000000
619,20,"Jan 22, 2019",Renegades,77500000,0,1521672,1521672,-75978328
477,78,"Apr 21, 2017",The Promise,90000000,8224288,10551417,2327129,-79448583
535,36,"Feb 21, 2020",Call of the Wild,82000000,0,0,0,-82000000
479,80,"Dec 13, 2017",Bright,90000000,0,0,0,-90000000
480,81,"Dec 31, 2019",Army of the Dead,90000000,0,0,0,-90000000
404,5,"Aug 16, 2002",The Adventures of Pluto Nash,100000000,4411102,7094995,2683893,-92905005
352,53,"Apr 27, 2001",Town & Country,105000000,6712451,10364769,3652318,-94635231
341,42,"Jun 14, 2019",Men in Black: International,110000000,3100000,3100000,0,-106900000
193,94,"Mar 11, 2011",Mars Needs Moms,150000000,21392758,39549758,18157000,-110450242
194,95,"Dec 31, 2020",Moonfall,150000000,0,0,0,-150000000
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,107000000,-200237650

In [31]:
#created data set of top 100 movies, by profit
tn100 = tn.head(100)

In [33]:
tn100.info()
tn100.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
id                     100 non-null int64
release_date           100 non-null object
movie                  100 non-null object
production_budget      100 non-null int64
domestic_gross         100 non-null int64
worldwide_gross        100 non-null int64
international_gross    100 non-null int64
profit                 100 non-null int64
dtypes: int64(6), object(2)
memory usage: 6.3+ KB

,id,production_budget,domestic_gross,worldwide_gross,international_gross,profit
count,100.000000,1.000000e+02,1.000000e+02,1.000000e+02,1.000000e+02,1.000000e+02
mean,50.500000,2.181470e+08,2.770578e+08,7.786893e+08,5.016315e+08,5.605423e+08
std,29.011492,4.847488e+07,1.760181e+08,4.630089e+08,3.158131e+08,4.451096e+08
min,1.000000,1.750000e+08,4.047937e+07,1.497624e+08,1.029343e+08,-2.002376e+08
25%,25.750000,1.850000e+08,1.529428e+08,4.107407e+08,2.638226e+08,2.112311e+08
50%,50.500000,2.000000e+08,2.345667e+08,7.448241e+08,4.710187e+08,5.420640e+08
75%,75.250000,2.300000e+08,3.525447e+08,1.018056e+09,6.442247e+08,7.932507e+08
max,100.000000,4.250000e+08,9.366622e+08,2.776345e+09,2.015838e+09,2.351345e+09

In [41]:
np.mean(tn100['production_budget'])

218147000.0

In [38]:
tnbottom100 = tn.tail(100)

In [40]:
np.mean(tnbottom100['production_budget'])

45188.0

In [42]:
imdbmerge = pd.merge(imdbprincipals, imdbname, on = 'nconst')

In [43]:
imdbmerge.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064"
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414"
2,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414"
3,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940"
4,tt0323808,10,nm0059247,editor,NaN,NaN,Sean Barton,1944.0,NaN,"editor,editorial_department,assistant_director","tt0402910,tt1022883,tt0086190,tt0490181"

In [44]:
imdbfinal = pd.merge(imdbmerge, imdbbasics, on = 'tconst')

In [45]:
imdbfinal.head()

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064",A Thin Life,A Thin Life,2018,75.0,Comedy
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",A Thin Life,A Thin Life,2018,75.0,Comedy
2,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940",A Thin Life,A Thin Life,2018,75.0,Comedy
3,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
4,tt5573596,4,nm0000476,actress,NaN,NaN,Sally Kirkland,1941.0,NaN,"actress,producer,miscellaneous","tt0315327,tt0092569,tt3216866,tt0102138",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy

In [46]:
imdbfinal.rename(columns = {'primary_title': 'movie'})

,tconst,ordering,nconst,category,job,characters,primary_name,birth_year,death_year,primary_profession,known_for_titles,movie,original_title,start_year,runtime_minutes,genres
0,tt0111414,1,nm0246005,actor,NaN,"[""The Man""]",Tommy Dysart,NaN,NaN,actor,"tt0093120,tt0076974,tt0084296,tt0077064",A Thin Life,A Thin Life,2018,75.0,Comedy
1,tt0111414,2,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",A Thin Life,A Thin Life,2018,75.0,Comedy
2,tt0111414,3,nm3739909,producer,producer,NaN,Barry Porter-Robinson,NaN,NaN,"producer,art_department","tt0290884,tt0101374,tt0111414,tt1566940",A Thin Life,A Thin Life,2018,75.0,Comedy
3,tt5573596,5,nm0398271,director,NaN,NaN,Frank Howson,1952.0,NaN,"actor,writer,producer","tt0104271,tt0094789,tt0102076,tt0111414",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
4,tt5573596,4,nm0000476,actress,NaN,NaN,Sally Kirkland,1941.0,NaN,"actress,producer,miscellaneous","tt0315327,tt0092569,tt3216866,tt0102138",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
5,tt5573596,7,nm0001445,actor,NaN,NaN,Martin Landau,1928.0,2017.0,"actor,producer,miscellaneous","tt0096316,tt0097123,tt0109707,tt0053125",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
6,tt5573596,1,nm0000925,actor,NaN,NaN,Steven Berkoff,1937.0,NaN,"actor,writer,director","tt0086034,tt0086960,tt1243957,tt0066921",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
7,tt5573596,3,nm0121007,actor,NaN,NaN,Eric Burdon,1941.0,NaN,"soundtrack,actor,composer","tt1478964,tt0443706,tt0118749,tt1408253",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
8,tt5573596,2,nm2105556,actor,NaN,NaN,Tait Brady,NaN,NaN,"producer,miscellaneous,actor","tt1931551,tt5611966,tt1316536,tt2177884",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
9,tt5573596,6,nm1852081,producer,producer,NaN,J. Marshall Craig,NaN,NaN,"producer,sound_department,director","tt0338019,tt5544722,tt5506054,tt5573596",Remembering Nigel,Remembering Nigel,2015,NaN,Comedy
10,tt0323808,10,nm0059247,editor,NaN,NaN,Sean Barton,1944.0,NaN,"editor,editorial_department,assistant_director","tt0402910,tt1022883,tt0086190,tt0490181",The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"
11,tt0323808,1,nm3579312,actress,NaN,"[""Beth Boothby""]",Brittania Nicol,NaN,NaN,"actress,soundtrack",tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"
12,tt0323808,2,nm2694680,actor,NaN,"[""Steve Thomson""]",Henry Garrett,NaN,NaN,actor,"tt1441953,tt1790885,tt2639254,tt3839822",The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"
13,tt0323808,3,nm0574615,actor,NaN,"[""Sir Lachlan Morrison""]",Graham McTavish,1961.0,NaN,"actor,soundtrack,director","tt0462499,tt0903624,tt1477834,tt1170358",The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"
14,tt0323808,4,nm0502652,actress,NaN,"[""Lady Delia Morrison""]",Jacqueline Leonard,1967.0,NaN,actress,"tt0088512,tt0106097,tt0103939,tt0241383",The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"
15,tt0323808,5,nm0362736,director,NaN,NaN,Robin Hardy,1929.0,2016.0,"actor,writer,director","tt0070917,tt0097375,tt0091032,tt0323808",The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"
16,tt0323808,6,nm0811056,producer,producer,NaN,Peter Snell,1938.0,NaN,"producer,soundtrack,executive","tt0070917,tt2231097,tt0093771,tt0078836",The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"
17,tt0323808,7,nm0914939,producer,producer,NaN,Peter Watson-Wood,NaN,NaN,"producer,production_manager","tt0337923,tt0171308,tt0097375,tt0111151",The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"
18,tt0323808,8,nm0779346,composer,NaN,NaN,John Scott,1930.0,NaN,"music_department,soundtrack,composer","tt0084935,tt0165854,tt0245712,tt0077064",The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"
19,tt0323808,9,nm0676104,cinematographer,NaN,NaN,Jan Pester,NaN,NaN,"camera_department,cinematographer,assistant_di...","tt0466816,tt0178737,tt0805825,tt0117631",The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"
20,tt2081348,10,nm0059247,editor,NaN,NaN,Sean Barton,1944.0,NaN,"editor,editorial_department,assistant_director","tt0402910,tt1022883,tt0086190,tt0490181",Rearview,Rearview,2017,80.0,Thriller
21,tt2081348,1,nm3687902,actress,NaN,"[""Nicky""]",Antonia Thomas,1986.0,NaN,"actress,soundtrack,writer","tt2481198,tt6470478,tt1548850,tt4051832",Rearview,Rearview,2017,80.0,Thriller
22,tt2081348,2,nm0803397,actor,NaN,"[""Paul""]",Jamie Sives,1973.0,NaN,"actor,producer,director","tt0862467,tt0329767,tt0291341,tt1226229",Rearview,Rearview,2017,80.0,Thriller
23,tt2081348,3,nm0801043,actor,NaN,"[""Johnno""]",Jay Simpson,1966.0,NaN,actor,"tt1104126,tt9548664,tt7366338,tt4686698",Rearview,Rearview,2017,80.0,Thriller
24,tt2081348,4,nm2353331,actor,NaN,"[""Simon""]",James Krishna Floyd,NaN,NaN,actor,"tt1424003,tt2076897,tt4387170,tt2351868",Rearview,Rearview,2017,80.0,Thriller
25,tt2081348,5,nm1258367,director,NaN,NaN,Avril E. Russell,NaN,NaN,"writer,director,editor","tt6897948,tt1674686,tt3900182,tt2081348",Rearview,Rearview,2017,80.0,Thriller
26,tt2081348,6,nm0622705,director,co-director,NaN,Orson Nava,NaN,NaN,"director,writer,actor","tt1634520,tt2081348,tt4128454,tt5840616",Rearview,Rearview,2017,80.0,Thriller
27,tt2081348,7,nm1062736,producer,producer,NaN,Stella Nwimo,NaN,NaN,"producer,production_manager,miscellaneous","tt8325880,tt6078346",Rearview,Rearview,2017,80.0,Thriller
28,tt2081348,8,nm5049053,composer,NaN,NaN,Richard Keyworth,NaN,NaN,"composer,sound_department","tt2081348,tt2444514,tt2796772,tt2146342",Rearview,Rearview,2017,80.0,Thriller
29,tt2081348,9,nm0003099,cinematographer,NaN,NaN,Jan Richter-Friis,NaN,NaN,"cinematographer,camera_department,miscellaneous","tt0220261,tt0112453,tt1074206,tt1851040",Rearview,Rearview,2017,80.0,Thriller
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1027882,tt9549028,2,nm10375424,director,NaN,NaN,Javier Moreno,NaN,NaN,"director,writer,editor",NaN,The Pillars,The Pillars,2018,57.0,Documentary
1027883,tt9549028,3,nm10375423,director,NaN,NaN,Claudia Negro,NaN,NaN,"director,writer,editor",NaN,The Pillars,The Pillars,2018,57.0,Documentary
1027884,tt9549028,4,nm8533630,director,NaN,NaN,Lucia Touceda,NaN,NaN,"director,writer,editor",tt6180640,The Pillars,The Pillars,2018,57.0,Documentary
1027885,tt9549028,5,nm8533565,director,NaN,NaN,Raúl Vallejo,NaN,NaN,"director,writer,art_department",tt6180640,The Pillars,The Pillars,2018,57.0,Documentary
1027886,tt9549028,6,nm8533506,cinematographer,NaN,NaN,Fernando Torcal,NaN,NaN,"camera_department,actor,cinematographer","tt8951078,tt7428476,tt9549028,tt6145228",The Pillars,The Pillars,2018,57.0,Documentary
1027887,tt9576232,10,nm10388578,actor,NaN,"[""Oliver the Octopus""]",Derek Albert,NaN,NaN,NaN,NaN,"Seaper Powers, In Search of Bleu Jay's Treasure","Seaper Powers, In Search of Bleu Jay's Treasure",2019,75.0,Animation
1027888,tt9576232,1,nm6734397,actress,NaN,"[""Narrator""]",Kim Cameron,NaN,NaN,"actress,director,writer","tt8819842,tt9576232","Seaper Powers, In Search of Bleu Jay's Treasure","Seaper Powers, In Search of Bleu Jay's Treasure",2019,75.0,Animation
1027889,tt9576232,2,nm10436514,actress,NaN,"[""Mom""]",Rebecca E. Downey,NaN,NaN,actress,tt9576232,"Seaper Powers, In Search of Bleu Jay's Treasure","Seaper Powers, In Search of Bleu Jay's Treasure",2019,75.0,Animation
1027890,tt9576232,3,nm10436515,actress,NaN,"[""Emma""]",Margaret Huerta,NaN,NaN,actress,tt9576232,"Seaper Powers, In Search of Bleu Jay's Treasure","Seaper Powers, In Search of Bleu Jay's Treasure",2019,75.0,Animation
1027891,tt9576232,4,nm10436706,actress,NaN,"[""Sandra""]",Lyrical Grenade,NaN,NaN,actress,tt9576232,"Seaper Powers, In Search of Bleu Jay's Treasure","Seaper Powers, In Search of Bleu Jay's Treasure",2019,75.0,Animation
1027892,tt9576232,5,nm6661404,composer,NaN,NaN,John DePatie,NaN,NaN,"music_department,actor,composer","tt3905858,tt9576232,tt3895930","Seaper Powers, In Search of Bleu Jay's Treasure","Seaper Powers, In Search of Bleu Jay's Treasure",2019,75.0,Animation
1027893,tt9576232,6,nm10436707,actor,NaN,"[""Captain""]",Sean Birdman Gould,NaN,NaN,actor,tt9576232,"Seaper Powers, In Search of Bleu Jay's Treasure","Seaper Powers, In Search of Bleu Jay's Treasure",2019,75.0,Animation
1027894,tt9576232,7,nm5885804,actor,NaN,"[""Hotel Owner""]",Jono De Leon,NaN,NaN,actor,"tt3129168,tt9576232","Seaper Powers, In Search of Bleu Jay's Treasure","Seaper Powers, In Search of Bleu Jay's Treasure",2019,75.0,Animation
1027895,tt9576232,8,nm10436708,actor,NaN,"[""Beazley""]",Federico Colloca,NaN,NaN,actor,tt9576232,"Seaper Powers, In Search of Bleu Jay's Treasure","Seaper Powers, In Search of Bleu Jay's Treasure",2019,75.0,Animation
1027896,tt9576232,9,nm10388577,actress,NaN,"[""Olivia the Octopus""]",Mish Elle,NaN,NaN,actress,NaN,"Seaper Powers, In Search of Bleu Jay's Treasure","Seaper Powers, In Search of Bleu Jay's Treasure",2019,75.0,Animation
1027897,tt9577520,1,nm5675408,director,NaN,NaN,Chris Watney,NaN,NaN,"producer,director,writer",tt9577520,Brothers in Football,Brothers in Football,2018,87.0,Documentary
1027898,tt9577520,2,nm10388838,producer,executive producer,NaN,Jay Barrymore,NaN,NaN,producer,tt9577520,Brothers in Football,Brothers in Football,2018,87.0,Documentary
1027899,tt9577520,3,nm10406852,composer,NaN,NaN,Rich Austin,NaN,NaN,composer,tt9577520,Brothers in Football,Brothers in Football,2018,87.0,Documentary
1027900,tt9577520,4,nm10406853,composer,NaN,NaN,Dom Franco,NaN,NaN,composer,tt9577520,Brothers in Football,Brothers in Football,2018,87.0,Documentary
1027901,tt9577520,5,nm3883032,composer,NaN,NaN,Enrico Wolf,NaN,NaN,composer,"tt9577520,tt1642617",Brothers in Football,Brothers in Football,2018,87.0,Documentary
1027902,tt9577520,6,nm3886306,cinematographer,NaN,NaN,Tom Gorst,NaN,NaN,"miscellaneous,writer,producer","tt1566503,tt1515091,tt3127898,tt2071480",Brothers in Football,Brothers in Football,2018,87.0,Documentary
1027903,tt9577520,7,nm10406854,editor,NaN,NaN,Gary Donald,NaN,NaN,editor,tt9577520,Brothers in Football,Brothers in Football,2018,87.0,Documentary
1027904,tt9678962,1,nm3868049,actor,NaN,"[""Maarten""]",Maarten Wijsman,NaN,NaN,"director,production_manager","tt9678962,tt1627929",Fuel,Fuel,2018,NaN,"Documentary,Sport"
1027905,tt9678962,2,nm7786516,cinematographer,NaN,NaN,Evert Bazuin,1995.0,NaN,"camera_department,cinematographer,director","tt9100712,tt6315790,tt8737236,tt9015188",Fuel,Fuel,2018,NaN,"Documentary,Sport"
1027906,tt9679036,1,nm9742452,actress,NaN,"[""Yuna Takahashi""]",Sherman Tsang,NaN,NaN,actress,"tt8772556,tt9679036,tt6143796,tt8047864","A Girl, a Boy, a Penny and a Very, Very, Very ...","A Girl, a Boy, a Penny and a Very, Very, Very ...",2019,75.0,"Comedy,Drama"
1027907,tt9679036,2,nm10435077,actor,NaN,"[""Dev Williams""]",Hardi Zala,NaN,NaN,actor,NaN,"A Girl, a Boy, a Penny and a Very, Very, Very ...","A Girl, a Boy, a Penny and a Very, Very, Very ...",2019,75.0,"Comedy,Drama"
1027908,tt9679036,3,nm7751067,actress,NaN,"[""Penelope (Penny) Fitzherbert""]",Jacqueline Godbout,NaN,NaN,"actress,director,writer","tt8521054,tt9679036,tt8141472","A Girl, a Boy, a Penny and a Very, Very, Very ...","A Girl, a Boy, a Penny and a Very, Very, Very ...",2019,75.0,"Comedy,Drama"
1027909,tt9679036,4,nm10435078,actress,NaN,"[""The Old Lady""]",Luanne M. Ashe,NaN,NaN,actress,NaN,"A Girl, a Boy, a Penny and a Very, Very, Very ...","A Girl, a Boy, a Penny and a Very, Very, Very ...",2019,75.0,"Comedy,Drama"
1027910,tt9679036,5,nm9728620,director,NaN,NaN,Julia Beney,NaN,NaN,"production_manager,director,writer","tt4777160,tt9269288,tt7512582,tt9679036","A Girl, a Boy, a Penny and a Very, Very, Very ...","A Girl, a Boy, a Penny and a Very, Very, Very ...",2019,75.0,"Comedy,Drama"
1027911,tt9679036,6,nm8336361,composer,NaN,NaN,Georgina Hay,NaN,NaN,"composer,music_department","tt2328900,tt4537896,tt5478478,tt5311542","A Girl, a Boy, a Penny and a Very, Very, Very ...","A Girl, a Boy, a Penny and a Very, Very, Very ...",2019,75.0,"Comedy,Drama"